OpenFOAM-v2112/tutorials/multiphase/overInterDyMFoam/floatingBodyWithSpring/background/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.2  -0.2 -0.2)
    (1.2   -0.2 -0.2)
    (1.2    1.2 -0.2)
    (-0.2   1.2 -0.2)
    (-0.2  -0.2 1)
    (1.2   -0.2 1)
    (1.2    1.2 1)
    (-0.2   1.2 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 80 70) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    // Dummy patch to trigger overset interpolation before any other bcs
    oversetPatch
    {
        type overset;
        faces ();
    }
    stationaryWalls
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    sidePatch
    {
        type patch;
        faces
        (
            (2 6 5 1)
            (1 5 4 0)
            (3 7 6 2)
            (0 4 7 3)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
